시리즈와 데이터프레임 데이터 생성

In [67]:
import pandas as pd

In [68]:
s=pd.Series() #=> Series의 객체가 만들어진다!
#클래스이름() : 생성자 함수(매서드, 클래스이름과 동일한 함수)
# ex) 붕어빵기계() : 기본붕어빵 / 붕어빵기계('설탕') : 설탕붕어빵 / 붕어빵기계('크림'); 크림 붕어빵

In [69]:
s

Series([], dtype: float64)

In [70]:
s=pd.Series(['banana',40])
# 기본적으로 인덱스는 0부터 부여됨
#바나나 문자열이 들어간 Series가 만들어짐(0은 인덱스, 데이터는 banana)
s

0    banana
1        40
dtype: object

In [71]:
s=pd.Series(['banana',40],index=[5,10]) # 인덱스를 직접 지정(5번, 10번으로!)
s

5     banana
10        40
dtype: object

In [72]:
s=pd.Series(['banana',40],index=['first','second']) # 문자로 인덱스 지정도 가능(first, second 형식으로!)
s

first     banana
second        40
dtype: object

In [73]:
s[0] #행 번호 사용도 가능

'banana'

In [74]:
s['first'] #문자열 지정했으면 더불어 사용 가능

'banana'

데이터 프레임 만들기

In [75]:
people=pd.DataFrame({
    'Name':['Kim','Lee'],  #키와 2개의 벨류 지정할 때, 대괄호로 묶어 리스트 형태로 바꾸어준다
    'Occupation':['Student','Chemiset'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]}) #딕셔너리를 데이터프레임 생성자 함수에 작성
#데이터프레임도 생성시 인덱스를 부여하지 않으면 0번부터 자동으로 부여된다
#데이터는 입력한 순서대로 만들어진다

In [76]:
people

  Name Occupation        Born        Died  Age
0  Kim    Student  1920-07-25  1958-04-16   37
1  Lee   Chemiset  1876-06-13  1937-10-16   61

In [77]:
#성으로 인덱스 지정하기
people=pd.DataFrame({
    'Occupation':['Student','Chemiset'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]},index=['Kim' ,'Lee'])

In [78]:
people

    Occupation        Born        Died  Age
Kim    Student  1920-07-25  1958-04-16   37
Lee   Chemiset  1876-06-13  1937-10-16   61

In [79]:
#Age와 Died의 순서를 바꾸기
people=pd.DataFrame({
    'Occupation':['Student','Chemiset'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]},index=['Kim' ,'Lee'],
columns=['Occupation','Born','Age','Died']
)

In [80]:
people

    Occupation        Born  Age        Died
Kim    Student  1920-07-25   37  1958-04-16
Lee   Chemiset  1876-06-13   61  1937-10-16

In [81]:
first_row=people.loc['Lee']
type(first_row)
#Series 자료형인데 object로 나옴 => 그럼에도 Series 함수가 맞음

pandas.core.series.Series

In [82]:
first_row

Occupation      Chemiset
Born          1876-06-13
Age                   61
Died          1937-10-16
Name: Lee, dtype: object

In [83]:
first_row.index #인덱스를 추출하는 속성(행에 대한 인덱스가 쫘륵 나옴)

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [84]:
first_row.values

array(['Chemiset', '1876-06-13', 61, '1937-10-16'], dtype=object)

In [85]:
first_row.keys() #함수이기 때문에 소괄호() 붙인다 / 인덱스 추출은 index, keys 함수 사용
#인덱스 개체도 cbject

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [86]:
first_row.keys()[0]

'Occupation'

In [87]:
ages=people['Age']
ages

Kim    37
Lee    61
Name: Age, dtype: int64

In [88]:
ages.mean() #평균값

49.0

In [89]:
ages.min() #최소값

37

In [90]:
ages.max() #최대값

61

In [91]:
ages.std() #표준편차

16.97056274847714

In [92]:
scientists=pd.read_csv("data/scientists.csv")

In [93]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [94]:
#[문제] Age 열 컬럼만 찾아서 ages에 대입하라
ages=scientists['Age']

In [95]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [96]:
#[문제] 가장 나이 많은 사람 추출
ages.max()

90

In [97]:
ages.mean()

59.125

불린 추출: 특정 조건을 만족하는 값만 추출

In [98]:
#평균 나이보다 나이가 많은 사람의 데이터를 추출
#불린 : True of False
#즉, 조건이 참인 것들만 뽑아내는 것

In [99]:
ages>ages.min() #=> 평균보다 크면 True 아니면 False
#조건을 줘서 '불린값'만 추출한 것임

0    False
1     True
2     True
3     True
4     True
5     True
6     True
7     True
Name: Age, dtype: bool

In [100]:
type(ages>ages.min()) #불린값을 가진 series 개체

pandas.core.series.Series

In [101]:
ages[ages>ages.mean()] #조건식을 만족한 값들만 출력(불린추출)
#브로드캐스팅(broadcasting:1개-> 8개로 확장 -> 비교 수행)
#비교대상은 8개인데 나는 1개일 때 비교대상만큼 복사해서 확장함
#수치데이터 값이 1개 있으면 스칼라

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [102]:
ages[[True,True,False,True,True,True,True,True]] #True 값만 추출, False값은 제외

0    37
1    61
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [103]:
ages+ages #백터간 덧셈(동일한 인덱스에 있는 값들끼리 덧셈)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [104]:
ages*ages #백터 요소간 곱셈(element-wise product): 백터의 내적

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [105]:
ages+100 #100이 스칼라인데 브로드캐스팅함

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [106]:
ages*2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [107]:
pd.Series([1,100]) #벡터

0      1
1    100
dtype: int64

In [108]:
ages+pd.Series([1,100]) 
# 벡터와 스칼라간 연산 -> 스칼라 값에 대한 브로드캐스팅 -> 연산
# 벡터와 벡터간 연산 -> 인덱스가 일치한 0,1만 계산

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [109]:
pd.Series([1,100], index=[1000,2000])

1000      1
2000    100
dtype: int64

In [110]:
ages+pd.Series([1,100], index=[1000,2000]) 
#2개 벡터의 index가 동일하지 않으므로 NaN 결과 값이 나옴

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
1000   NaN
2000   NaN
dtype: float64

NaN: 누락값

In [111]:
# Nan 값과 연산을 수행하면 결과값도 Nan이 나옴 
# 숫자가 아닌 상수값을 나타내는 값이 Nan임
# Nan 결측치

In [112]:
ages #인덱스 기준으로 오름차순 정렬(데이터가 아님)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [113]:
ages.sort_index(ascending=True)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [114]:
ages.sort_index(ascending=False)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [115]:
ages.sort_values(ascending=True)

0    37
6    41
5    45
4    56
1    61
3    66
7    77
2    90
Name: Age, dtype: int64

In [116]:
ages.sort_values(ascending=False)

2    90
7    77
3    66
1    61
4    56
5    45
6    41
0    37
Name: Age, dtype: int64

In [117]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [129]:
#평균 나이보다 값이 큰 나이를 갖는 사람들만 출력
scientists['Age'] > scientists['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [130]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [131]:
scientists.loc[[True,True,False,True]] #0,1,3번추출, 지정안된건 기본적으로 추출안됨

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician
3        Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [132]:
scientists*2 #데이터 프레임에 대한 곱셈 => 문자열 2번 반복, 정수 2배 출력

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

시리즈를 생성해서 s변수에 대입(도시명: 인덱스, 수치: 데이터)

서울 9904312   

부산 3448737   

인천 2890451    

대구 2466052

In [143]:
s=pd.Series([ 9904312, 3448737, 2890451,2466052], index=['서울','부산','인천', '대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [144]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [145]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [146]:
s.name="인구" #데이터에 이름을 붙임
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [148]:
s.index.name="도시명"
s

도시명
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [150]:
#100만 단위로 인구가 출력되도록 코드 작성
#9904312 -> 9.904312
s/1000000 #인덱스는 연산안하고 데이터만 연산수행

도시명
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [154]:
s['부산']

3448737

In [161]:
s[[0,3,1]]

도시명
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [162]:
s[["서울","대구","부산"]]

도시명
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [163]:
s[(2500000<s)] #트루에 해당하는것만 추출

도시명
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [166]:
s[(5000000>s)] #트루에 해당하는것만 추출

도시명
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [167]:
s[(2500000<s)&(5000000>s)] #두개 묶음

도시명
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [219]:
s[(250e4<s)&(500e4>s)] #두개 묶음

도시명
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [220]:
s[[1,2]]

도시명
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [221]:
s[1:3] #범위를 나타날때는 대괄호를 사용하지 않음. 콜론 기호 뒤의 숫자는 미포함됨

도시명
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [222]:
s["부산":"대구"] #인덱스의 경우 :으로 범위를 지정하더라도 마지막 문자가 포함됨

도시명
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [223]:
s2=pd.Series(range(10,13), index=["a","b","c"])

In [224]:
s2[1]

11

In [225]:
#인덱스가 영문자로 된 경우에는 점으로도 접근 가능
s2.a

10

In [226]:
"서울" in s #'서울' 인덱스가 있나요?

True

In [227]:
print(s.values)
print(s.index)
print(s.items()) #인덱스와 데이터가 모두 추출

[9904312 3448737 2890451 2466052]
Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시명')
<zip object at 0x00000263321026C8>

In [228]:
for k, v in s.items(): #인덱스와 데이터가 k,v에 전달됨
    print(k,v)

서울 9904312
부산 3448737
인천 2890451
대구 2466052

In [229]:
s2 = pd.Series([9600000, 3300000, 2600000, 1500000], index=['서울', '부산', '인천', '대전'])

In [230]:
s2

서울    9600000
부산    3300000
인천    2600000
대전    1500000
dtype: int64

In [231]:
ds=s-s2
ds 
#s, s2 모두다 가지고 있는 인덱스에 대한 데이터만 연산이 수행
#Nan이 포함되어 있는 경우에는 연산결과가 float로 나옴

대구         NaN
대전         NaN
부산    148737.0
서울    304312.0
인천    290451.0
dtype: float64

In [232]:
ds.notnull() #null: 값이 없는 것, 이 아니냐?(값이 있느냐?)

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [233]:
ds[ds.notnull()] #Nan이 아닌 값들만 추출

부산    148737.0
서울    304312.0
인천    290451.0
dtype: float64

In [242]:
#인구의 증가률
rs=(s-s2)/s2*100
rs=rs[rs.notnull()]
rs

부산     4.507182
서울     3.169917
인천    11.171192
dtype: float64

In [243]:
rs["부산"]=1.63 #데이터수정

In [244]:
rs

부산     1.630000
서울     3.169917
인천    11.171192
dtype: float64

In [245]:
rs["대구"]=1.4 #데이터추가
rs

부산     1.630000
서울     3.169917
인천    11.171192
대구     1.400000
dtype: float64

In [246]:
#데이터 삭제
del rs['서울']
rs

부산     1.630000
인천    11.171192
대구     1.400000
dtype: float64

In [247]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

# DataFrame에 딕셔너리 들어가게 해줄수 있음

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [248]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [249]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [250]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [255]:
df.index.name="도시"
df.columns.name="특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [256]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [258]:
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [260]:
df[["2010","2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [262]:
type(df[["2010","2015"]])

pandas.core.frame.DataFrame

In [263]:
type(df["2010"]) #Series

pandas.core.series.Series

In [264]:
type(df[["2010"]]) #DataFrame

pandas.core.frame.DataFrame